package homeworks._01_21;
/*
Написать программу, которая принимает на вход три целых числа:
*1. algorithmld - тип алгоритма
        1.вычисление ряда чисел Фибоначчи;
        2.вычисление факториала
*2. LoорТуре - тип циклов, которые нужно использовать:
        1. цикл while
        2. цикл do-while
        3. цикл for
*3. n - параметр, передаваемый в алгоритм.

К примеру, если передаются числа "1 3 5", программе необходимо вывести на экран первые 5 чисел Фибоначчи и при вычислении использовать цикл for.
К примеру, если передаются числа "2 1 7" , программе необходимо вывести на экран факториал числа 7 и при его вычислении использовать цикл while.
Числа Фибоначчи начинаются с нуля: 0 11235 ...

 */

public class Main {
}
